### Import Modules

In [1]:
import pandas as pd
import numpy as np

### Load and Check Dataset

In [2]:
data = pd.read_csv('IMDB-database-update.csv', encoding = 'latin1')
data.head(3)

,movie_ID,movie_title,duration,color,title_year,country,language,content_rating,budget_USD,gross_USD,...,actor_3_facebook?,actor_3_facebook_likes,cast_total_facebook_likes,movie_facebook?,movie_facebook_likes;,facenumber_in_poster,num_voted_users,num_user_for_reviews,imdb_score,imdb_top_250
0,1,Avatar,178,1,2009,USA,English,PG-13,237000000,760505847,...,1,855,4834,1,33000,0,886204,3054,7.9,0
1,2,Pirates of the Caribbean: At World's End,169,1,2007,USA,English,PG-13,300000000,309404152,...,1,1000,48350,0,0,0,471220,1238,7.1,0
2,3,The Dark Knight Rises,164,1,2012,USA,English,PG-13,250000000,448130642,...,1,23000,106759,1,164000,0,1144337,2701,8.5,1

### 1. How many rows and columns?

In [3]:
data.shape

(3781, 36)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3781 entries, 0 to 3780
Data columns (total 36 columns):
movie_ID                     3781 non-null int64
movie_title                  3781 non-null object
duration                     3781 non-null int64
color                        3781 non-null int64
title_year                   3781 non-null int64
country                      3781 non-null object
language                     3781 non-null object
content_rating               3781 non-null object
budget_USD                   3781 non-null int64
gross_USD                    3781 non-null int64
net_USD                      3781 non-null int64
profitable                   3781 non-null int64
director_name                3781 non-null object
director_top20?              3781 non-null object
director_facebook?           3781 non-null int64
director_facebook_likes      3781 non-null int64
actor_1_name                 3781 non-null object
actor_top20?                 3781 non-null int64
actor_1_facebook?            3781 non-null int64
actor_1_facebook_likes       3781 non-null int64
actor_2_name                 3781 non-null object
actor_top20?.1               3781 non-null int64
actor_2_facebook?            3781 non-null int64
actor_2_facebook_likes       3781 non-null int64
actor_3_name                 3781 non-null object
actor_top20?.2               3781 non-null int64
actor_3_facebook?            3781 non-null int64
actor_3_facebook_likes       3781 non-null int64
cast_total_facebook_likes    3781 non-null int64
movie_facebook?              3781 non-null int64
movie_facebook_likes;        3781 non-null int64
facenumber_in_poster         3781 non-null int64
num_voted_users              3781 non-null int64
num_user_for_reviews         3781 non-null int64
imdb_score                   3781 non-null float64
imdb_top_250                 3781 non-null int64
dtypes: float64(1), int64(26), object(9)
memory usage: 1.0+ MB

### 2. What are the top 3 movies with highest nett profit in 2013?

In [5]:
data[data["title_year"]==2013].sort_values("net_USD", ascending = False)[["movie_title","net_USD"]].head(3)

                          movie_title    net_USD
1614  The Hunger Games: Catching Fire  294645577
236                   Despicable Me 2  292049635
57                             Frozen  250736600

In [6]:
data_2013 = data[data["title_year"]==2013]
data_2013.head()

,movie_ID,movie_title,duration,color,title_year,country,language,content_rating,budget_USD,gross_USD,...,actor_3_facebook?,actor_3_facebook_likes,cast_total_facebook_likes,movie_facebook?,movie_facebook_likes;,facenumber_in_poster,num_voted_users,num_user_for_reviews,imdb_score,imdb_top_250
6,7,Man of Steel,143,1,2013,USA,English,PG-13,225000000,291021565,...,1,748,20495,1,118000,0,548573,2536,7.2,0
18,19,Monsters University,104,1,2013,USA,English,G,200000000,268488329,...,1,760,14863,1,44000,0,235025,265,7.3,0
25,26,World War Z,123,1,2013,USA,English,PG-13,190000000,202351611,...,1,1000,32392,1,129000,0,465019,995,7.0,0
26,27,Star Trek Into Darkness,132,1,2013,USA,English,PG-13,190000000,228756232,...,1,928,21411,1,92000,0,395573,1171,7.8,0
27,28,Pacific Rim,131,1,2013,USA,English,PG-13,190000000,101785482,...,1,919,19166,1,83000,0,381148,1106,7.0,0

In [7]:
data_2013[["movie_title","net_USD","title_year"]].sort_values("net_USD", ascending = False).head(3)

                          movie_title    net_USD  title_year
1614  The Hunger Games: Catching Fire  294645577        2013
236                   Despicable Me 2  292049635        2013
57                             Frozen  250736600        2013

### 3. What are the top 3 movies with highest gross profit in 2009

In [8]:
data_2009 = data[data["title_year"]==2009]

In [9]:
data_2009[["movie_title","gross_USD","title_year"]].sort_values("gross_USD", ascending = False).head(3)

                                 movie_title  gross_USD  title_year
0                                     Avatar  760505847        2009
19       Transformers: Revenge of the Fallen  402076689        2009
3094  Harry Potter and the Half-Blood Prince  301956980        2009

### 4. How many non-english movies are in the dataset?

In [10]:
non_english = data[data["language"]!="English"]
non_english["movie_ID"].count()

153

### 5.What are top 3 languages in the dataset aside English (based on number of movies)?

In [11]:
non_english["language"].value_counts().sort_values(ascending=False).head(3)

French      33
Spanish     23
Mandarin    14
Name: language, dtype: int64

### 6.What are the top 3 countries with the highest nett profit in all dataset times?

In [12]:
top_3 = data[["country","net_USD"]].groupby('country').sum().sort_values('net_USD', ascending=False).head(3)
top_3

               net_USD
country
USA        52003933174
UK          1531614524
Australia    252571616

### 7.What are the average budget of all movies in dataset in 2013?

In [13]:
data_2013 = data_2013['budget_USD'].mean()
data_2013

51069610.77439024

### 8.What are the average budget of all movies in dataset in 2014?

In [14]:
data_2014 = data[data["title_year"]==2014]
data_2014 = data_2014['budget_USD'].mean()
data_2014

49919006.62251656

### 9.Which one is higher, average budget of all movies in dataset in 2014 or 2013

In [15]:
if data_2014>data_2013:
    print("The average budget of all movies in dataset 2014 is higher than in 2013")
else :
    print("The average budget of all movies in dataset 2013 is higher than in 2014")

The average budget of all movies in dataset 2013 is higher than in 2014

### 10.What movie that resulted highest nett profit of all dataset times? How much did the movie make?

In [16]:
top_1 = data.sort_values('net_USD', ascending=False).head(1)
top_1[['movie_title','net_USD','title_year']]

  movie_title    net_USD  title_year
0      Avatar  523505847        2009